---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBarType.StirrupTieBendDiameter
source: html/5b62432d-4486-5df5-fc6a-1b2387924d64.htm
---
# Autodesk.Revit.DB.Structure.RebarBarType.StirrupTieBendDiameter Property

Defines bar and hook bend diameter for rebar whose style is stirrup/tie

## Syntax (C#)
```csharp
public double StirrupTieBendDiameter { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: the bend diameter stirrupTieBendDiam isn't between bar diameter and 99.0